Тестовая_база_ERP_14/src/Catalogs/КлассыОбъектовЭксплуатации/КлассыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассыОбъектовЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПодклассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтныйЦиклПоИнтервалуНаработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКлассУзла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДляКонтроля</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиНаработки</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитыватьОстаточныйРесурс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрироватьОтИсточника</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьРегистрации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПересчитыватьСреднесуточноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйПериодРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйПериодРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныйЦикл</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалНаработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоИнтервалуНаработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалНаработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/КлассыОбъектовЭксплуатации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура проверки заполнения табличных частей правил планирования
//
// Параметры:
// 		ЭтотОбъект - СправочникОбъект.КлассыОР, СправочникОбъект.ПодклассыОР - Объект справочника, табличные части которого необходимо проверить
// 		МассивНеПроверяемыхРеквизитов - Массив - Массив имен реквизитов, которые необходимо удалить из проверяемых
// 		Отказ - Булево - Признак ошибки.
//
Процедура ПроверкаЗаполненияПравилПланирования(ЭтотОбъект, МассивНеПроверяемыхРеквизитов, Отказ = Ложь) Экспорт
	
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалВремениПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ЕдиницаВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалНаработки");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалНаработкиПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ПоказательНаработки");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалВремениПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ЕдиницаВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалНаработки");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалНаработкиПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ПоказательНаработки");
	
	СоответствиеВидовРемонтов = Новый Соответствие;
	
	Для Каждого Строка Из ЭтотОбъект.РемонтныйЦикл Цикл
		
		АдресОшибки = НСтр("ru = 'в строке %НомерСтроки% списка ""Ремонтный цикл""';
							|en = 'in line %НомерСтроки% of the ""Repair cycle"" list'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Строка.НомерСтроки);
		
		НомерСтроки = Строка.НомерСтроки;
		
		Если СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта) <> Неопределено Тогда
			// Вид ремонта уже присутствует в табличной части в другой строке
			
			ТекстОшибки = НСтр("ru = 'Вид ремонта ""%ВидРемонта%"" %АдресОшибки% уже присутствует в строке %НомерПредыдущейСтроки%';
								|en = 'Line %НомерПредыдущейСтроки% already contains the ""%ВидРемонта%"" repair kind %АдресОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%АдресОшибки%", АдресОшибки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидРемонта%", Строка.ВидРемонта);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерПредыдущейСтроки%", Формат(СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта), "ЧГ=0"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ВидРемонта"),,
				Отказ);
		Иначе
			СоответствиеВидовРемонтов.Вставить(Строка.ВидРемонта, НомерСтроки);
		КонецЕсли;
		
		Если ЭтотОбъект.РемонтныйЦиклПоИнтервалуНаработки Тогда
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';
									|en = 'The ""Interval between repairs"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ИнтервалНаработки"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ПоказательНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Единица измерения"" %АдресОшибки%';
									|en = 'The ""Unit of measure"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ПоказательНаработки"),
					,
					Отказ);
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';
									|en = 'The ""Interval between repairs"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ИнтервалВремени"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ЕдиницаВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Единица измерения"" %АдресОшибки%';
									|en = 'The ""Unit of measure"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ЕдиницаВремени"),
					,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СоответствиеВидовРемонтов.Очистить();
	
	Для Каждого Строка Из ЭтотОбъект.ПрочиеРемонты Цикл
		
		АдресОшибки = НСтр("ru = 'в строке %НомерСтроки% списка ""Прочие ремонты""';
							|en = 'in line %НомерСтроки% of the ""Other repairs"" list'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Строка.НомерСтроки);
		
		Если СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта) <> Неопределено Тогда
			// Вид ремонта уже присутствует в табличной части в другой строке
			
			ТекстОшибки = НСтр("ru = 'Вид ремонта ""%ВидРемонта%"" %АдресОшибки% уже присутствует в строке %НомерПредыдущейСтроки%';
								|en = 'Line %НомерПредыдущейСтроки% already contains the ""%ВидРемонта%"" repair kind %АдресОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%АдресОшибки%", АдресОшибки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидРемонта%", Строка.ВидРемонта);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерПредыдущейСтроки%", Формат(СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта), "ЧГ=0"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ВидРемонта"),,
				Отказ);
		Иначе
			СоответствиеВидовРемонтов.Вставить(Строка.ВидРемонта, НомерСтроки);
		КонецЕсли;
		
		Если Строка.ПоИнтервалуНаработки Тогда
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';
									|en = 'The ""Interval between repairs"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ИнтервалНаработки"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ПоказательНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Единица измерения"" %АдресОшибки%';
									|en = 'The ""Unit of measure"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ПоказательНаработки"),
					,
					Отказ);
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';
									|en = 'The ""Interval between repairs"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ИнтервалВремени"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ЕдиницаВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru = 'Не заполнена колонка ""Единица измерения"" %АдресОшибки%';
									|en = 'The ""Unit of measure"" column is not filled %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ЕдиницаВремени"),
					,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает наборы свойств по классу объектов эксплуатации
//
// Параметры:
// 		Класс - СправочникСсылка.КлассыОбъектовЭксплуатации - Ссылка на класс.
//
// Возвращаемое значение:
// 		Структура - Структура наборов свойств.
//
Функция ПолучитьНаборыСвойств(Класс) Экспорт
	
	СтруктураНаборов = Новый Структура(
		"ПаспортныеХарактеристики",
		Неопределено);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Классы.НаборСвойств КАК ПаспортныеХарактеристики
		|ИЗ
		|	Справочник.КлассыОбъектовЭксплуатации КАК Классы
		|ГДЕ
		|	Классы.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Класс);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СтруктураНаборов;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНаборов, Выборка);
	КонецЕсли;
	
	Возврат СтруктураНаборов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
